# Анализ продаж из CSV с записью результата в файл

## Постановка задачи (как в реальном проекте)

Есть _CSV_-файл с данными о продажах.

Нужно написать _Python_-скрипт, который:
- считывает входные данные из CSV-файла;
- фильтрует данные по региону;
- рассчитывает агрегированные метрики;
- сохраняет результат анализа в отдельный CSV-файл.

## Формат входных данных

📄 sales_input.csv
```
date,region,product,revenue
2024-01-01,EU,A,1200
2024-01-02,US,A,900
2024-01-03,EU,B,1500
2024-01-04,EU,A,700
2024-01-05,US,B,1100
```

## Формат выходных данных

📄 sales_summary.csv
```
region,sales_count,total_revenue,average_revenue
EU,3,3400,1133.33
```

(округление зависит от настроек, мы это обсудим позже)

## Полный, запускаемый пример (production-style)

```
import pandas as pd
from pathlib import Path


def load_sales_data(input_path: Path) -> pd.DataFrame:
    """
    Загружает данные о продажах из CSV-файла.
    """
    return pd.read_csv(input_path)


def analyze_sales_by_region(
    df: pd.DataFrame,
    region: str,
) -> pd.DataFrame:
    """
    Фильтрует продажи по региону и
    возвращает агрегированные метрики.
    """
    filtered_df = df.loc[df["region"] == region]

    result = pd.DataFrame(
        {
            "region": [region],
            "sales_count": [len(filtered_df)],
            "total_revenue": [filtered_df["revenue"].sum()],
            "average_revenue": [filtered_df["revenue"].mean()],
        }
    )

    return result


def save_summary(df: pd.DataFrame, output_path: Path) -> None:
    """
    Сохраняет результат анализа в CSV-файл.
    """
    df.to_csv(output_path, index=False)


def main() -> None:
    base_dir = Path(__file__).resolve().parent

    input_file = base_dir / "sales_input.csv"
    output_file = base_dir / "sales_summary.csv"

    sales_df = load_sales_data(input_file)

    summary_df = analyze_sales_by_region(
        sales_df,
        region="EU",
    )

    save_summary(summary_df, output_file)

    print("Analysis completed.")
    print(f"Result saved to: {output_file.resolve()}")


if __name__ == "__main__":
    main()
```

## Подробный разбор ключевых моментов

### Разделение ответственности (важно!)

Обратите внимание:
- `load_sales_data()` — **только загрузка**;
- `analyze_sales_by_region()` — **только бизнес-логика**;
- `save_summary()` — **только сохранение**;
- `main()` — **оркестрация**.

Это:
- облегчает тестирование;
- повышает читаемость;
- стандарт де-факто для production-кода.

### Фильтрация через `df.loc[...]`

`filtered_df = df.loc[df["region"] == region]`


Разворачиваем “по шагам”:

1. `df["region"] == region`

   → булев массив:

   `True / False` для каждой строки


2. `df.loc[...]`

   → выбирает строки, где `True`.

**Классический _Python_-аналог:**
```
rows = []
for _, row in df.iterrows():
    if row["region"] == region:
        rows.append(row)
```

В `pandas` такой код:
- медленнее;
- менее читаем;
- считается антипаттерном.

### Почему нет циклов

`filtered_df["revenue"].sum()`

Это:
- не цикл в _Python_;
- операция над `NumPy`-массивом;
- быстрый _C_-код.

Для анализа данных **циклы почти всегда признак неоптимального решения**.

### Почему результат — `DataFrame`

Даже если одна строка:
- формат стабилен;
- удобно:
  - писать в файл,
  - расширять,
  - объединять с другими результатами.